[
  {
    "company": "Memphis Grizzlies, LLC.",
    "role": "Cybersecurity Program Lead",
    "location": "Memphis, TN",
    "start": "Jul 2023",
    "end": "Present",
    "bullets": [
      "Mature the organization’s first enterprise-wide cybersecurity program across Business Ops, Basketball Ops, and arena OT/IoT—integrating Rapid7 SIEM/SOAR, SentinelOne EDR, and Microsoft Defender.",
      "Achieve near real-time detection & response (MTTD ~1 min, MTTR ~5 mins) via alert tuning, automation runbooks, and MSSP workflows.",
      "Deliver ~30% cost optimization with 90%+ asset visibility; consolidate overlapping tools/vendors.",
      "Lead Zero Trust rollout with Cloudflare ZTNA + device posture; decommission legacy VPN; reduce access tickets by ~80%.",
      "Operationalize vulnerability management (InsightVM) with risk-based SLAs and patch waves to eliminate critical backlog.",
      "Build exec dashboards & quarterly briefs aligning risk, roadmap, and budget to business outcomes."
    ]
  },
  {
    "company": "BlackRock, Inc.",
    "role": "Senior Associate — GRC",
    "location": "New York, NY",
    "start": "Jun 2022",
    "end": "Dec 2022",
    "bullets": [
      "Executed technical risk assessments and control testing across cloud and enterprise platforms; enable shift-left remediation.",
      "Standardized audit readiness and evidence collection, reducing time-to-close for observations.",
      "Leveraged Archer GRC to document and track control gaps and monitor remediation progress, ensuring centralized‬ governance and risk assessment readiness across all risk domains.‬"
      
    ]
  },
  {
    "company": "SS&C Technologies, Inc.",
    "role": "Senior Associate — IT Audit",
    "location": "New York, NY",
    "start": "Nov 2017",
    "end": "Apr 2021",
    "bullets": [
      "Led 12+ IT audits annually (SOX, NIST, GDPR) and mentor analysts while aligning findings to business impact.",
      "Automated recurring audit tests/scripts and build risk dashboards, saving 60+ hours per cycle.",
      "Partnered with internal teams to define control ownership, streamline evidence‬ workflows, and align technical audit procedures with business risk priorities.‬"
    ]
  }
]
